---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainerItem.IncludeFirstBar
source: html/45834539-61e2-aeba-fd24-d4acd5487ac8.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.IncludeFirstBar Property

Identifies if the first bar in rebar set is shown.

## Syntax (C#)
```csharp
public bool IncludeFirstBar { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - This rebar element represents a single bar (the layout rule is Single).